// © Copyright 2010, 2015-2016 HP Development Company, L.P.

TaskName = "Skanuj do komputera";

// Restore alert message
"RESTORE_TITLE" = "Czy na pewno chcesz przywrócić ustawienia?";
"RESTORE_MSG" = "W przypadku kontynuowania wszystkie skróty skanowania zostaną przywrócone do swojego oryginalnego stanu. Naciśnij opcję Anuluj, aby nie zmieniać skrótów, lub opcję Przywróć, aby przywrócić fabryczne ustawienia domyślne skrótów.";
"RESTORE_BUTTON_TITLE" = "Przywróć";

"DEFAULT_TASK_CAPTION" = "Nazwa zadania:";
"DONE" = "Gotowe";

// Task not found alert message
"TASK_NOT_FOUND_TITLE" = "Zadanie niedostępne";
"TASK_NOT_FOUND_DESC" = "Zadanie „%@” znalezione na urządzeniu nie jest dostępne w systemie. Wybierz inne zadanie.";

// Copy workflows fail alert message
"COPY_WORKFLOWS_TITLE" = "Błąd kopiowania przepływu pracy";
"COPY_WORKFLOWS_DESC" = "Kopiowanie przepływów pracy do folderu domeny urządzenia użytkownika nie powiodło się";

"DEVICE_NOT_FOUND_TITLE" = "Nie znaleziono urządzenia";
"DEVICE_NOT_FOUND_DESC" = "Wystąpił problem podczas komunikacji z urządzeniem. Upewnij się, że urządzenie jest włączone i prawidłowo podłączone, a następnie spróbuj ponownie.";

"COMPUTER_NAME_INFO_TITLE" = "Pole „Nazwa komputera” służy do wprowadzenia nazwy komputera, która ma być wyświetlana w urządzeniu HP."; //title for the Computer name info sheet
"COMPUTER_NAME_INFO_DESC" = "Liczba znaków możliwych do wprowadzenia zależy od urządzenia.";

"UNKNOWN_ERROR_TITLE" = "Nieznany błąd";
"UNKNOWN_ERROR_DESC" = "Podczas aktualizacji urządzenia wystąpił nieznany błąd. Upewnij się, że urządzenie jest włączone i poprawnie podłączone.";

"OK" = "OK";
"CANCEL" = "Anuluj";

"MOREINFO_TITLE" = "Więcej informacji";

// The following strings are displayed in SSMTaskController nib file

"SSM_TITLE" = "Menedżer skrótów skanowania"; // Title
"SSM_SHORT_DESC" = "Skróty skanowania służą do wykonywania rutynowych zadań skanowania przy użyciu przycisków na przednim panelu urządzenia HP."; // short description
"YOUR_COMPUTER_NAME" = "Nazwa Twojego komputera"; // displayed if device is connected through n/w
"CHANGE_BTN_TITLE" = "Zmień...";
"MORE_INFO_BTN_TITLE" = "Więcej informacji...";
"RESTORE_BTN_TITLE" = "Przywróć ustawienia domyślne";
"TEST_BTN_TITLE" = "Test...";
"EDIT_BTN_TITLE" = "Edytuj...";

// Error Messages.
"ERROR_PERMISSION_DENIED" = "Nie masz odpowiednich uprawnień dostępu do folderu „%@”. Aby wyświetlić lub zmienić uprawnienia dostępu, wybierz element w aplikacji Finder, a następnie wybierz opcje File (Plik) > Get Info (Pobierz informacje)."; // used from HPWFM, no need to get the localized string from customer.

// generic error
"ERROR" = "Błąd";
"ERROR_UNKNOWN_DESC" = "Wystąpił nieznany błąd.";

// Error when workflow not found when user clicks on front panel scan
"ERROR_SHORTCUT_NOT_FOUND_TITLE" = "Nie znaleziono skrótu";
"ERROR_SHORTCUT_NOT_FOUND_DESC" = "Nie znaleziono skrótu %1$@ dla urządzenia %2$@. Spróbuj ponownie zainstalować oprogramowanie.";

// Error displayed when HPScanWorkflow object creation fails for execution of workflow in SEH interface execute method
"ERROR_WORKFLOW_CREATE_FAIL_TITLE" = "Błąd tworzenia przepływu pracy";
"ERROR_WORKFLOW_CREATE_FAIL_DESC" = "Wystąpił nieznany błąd podczas tworzenia przepływu pracy. Spróbuj ponownie.";

// Error displayed when copyworkflows fails as due to non availability of permission at user device domain folder
"ERROR_CREATING_DIR_TITLE" = "Błąd podczas tworzenia katalogu";
"ERROR_CREATING_DIR_DESC" = "Wystąpił błąd podczas tworzenia katalogu %@. Sprawdź uprawnienia dostępu do folderu nadrzędnego, a następnie spróbuj ponownie";

// Error displayed when workflow does not exists when user tries to open the same in Automator
"ERROR_OPENING_WORKFLOW_IN_AUTOMATOR_DESC" = "Wystąpił błąd podczas otwierania przepływu pracy „%@” w aplikacji Automator. Nie można znaleźć przepływu pracy w jego pierwotnej lokalizacji";

// New additions: 3/1/2010

// Error displayed when scan link ID received from the device is invalid
"ERROR_INVALID_SCAN_LINK_ID_TITLE" = "Nieobsługiwany skrót skanowania";
"ERROR_INVALID_SCAN_LINK_ID_DESC" = "Nie można wykonać wybranego skrótu skanowania, ponieważ oprogramowanie nie może go rozpoznać. Wybierz inny skrót skanowania i spróbuj ponownie.";

// Tool tips for change, edit and test button
"TIP_FOR_CHANGE_BTN" = "Kliknij, aby zmienić nazwę komputera";
"TIP_FOR_EDIT_BTN" = "Edytuj wybrane zadanie";
"TIP_FOR_TEST_BTN" = "Uruchom wybrane zadanie";

// New additions: 3/1/2010

// Opt-in/Opt-out strings
"COMPUTER_NAME_TITLE" = "Nazwa Twojego komputera to";
"COMPUTER_NAME_DESCRIPTION" = "Po rozpoczęciu skanowania z urządzenia HP może zostać wyświetlony monit o wybranie komputera z listy komputerów hostów z włączoną funkcją skanowania do komputera.";
"COMPUTER" = "Komputer";
"COMPUTERS" = "Komputery";

"COMMUNICATION_ERROR" = "Nie można nawiązać komunikacji ze skanerem. Upewnij się, że urządzenie jest włączone, sprawdź połączenie oraz upewnij się, że sieć działa poprawnie. Pamiętaj, że w urządzeniu musi być włączona funkcja Bonjour.";
"INSTALLATION_ERROR" = "Na komputerze nie można znaleźć oprogramowania HP wymaganego przez funkcję skanowania do komputera. Pobierz i zainstaluj najnowsze oprogramowanie HP zalecane dla urządzenia ze strony http://www.hp.com/support, a następnie spróbuj ponownie.";
"SETUP_ERROR" = "Konfiguracja urządzenia nie została ukończona. Otwórz program HP Setup Assistant i postępuj zgodnie z instrukcjami, aby ukończyć konfigurację, a następnie spróbuj ponownie.";

"SCAN_TO_COMPUTER_CANNOT_BE_ENABLED" = "Nie można włączyć funkcji skanowania do komputera";
"SCAN_TO_COMPUTER_DESCRIPTION" = "Funkcja skanowania do komputera umożliwia uruchomienie skanowania przy użyciu panelu przedniego urządzenia HP i automatyczne wysłanie skanu do komputera.";

HSDScanActionNotFoundTitle = "Nie można zlokalizować czynności skanowania";
HSDScanActionNotFoundDescription = "Nie zarejestrowano czynności skanowania. Uruchom aplikację HP Scan (lokalizacja: %@), aby automatycznie zarejestrować czynność skanowania.";
